class AppStations {
  static const List<String> srtStations = [
    "수서", "동탄", "평택지제", "경주", "곡성", "공주", "광주송정", "구례구", "김천(구미)",
    "나주", "남원", "대전", "동대구", "마산", "목포", "밀양", "부산", "서대구",
    "순천", "여수EXPO", "여천", "오송", "울산(통도사)", "익산", "전주", "정읍",
    "진영", "진주", "창원", "창원중앙", "천안아산", "포항"
  ];

  static const List<String> ktxStations = [
    "서울", "용산", "영등포", "광명", "수원", "천안아산", "오송", "대전", "서대전",
    "김천구미", "동대구", "경주", "포항", "밀양", "구포", "부산", "울산(통도사)",
    "마산", "창원중앙", "경산", "논산", "익산", "정읍", "광주송정", "목포", "전주",
    "순천", "여수EXPO", "청량리", "강릉", "행신", "정동진"
  ];

  static const Map<String, String> srtStationCodes = {
    "수서": "0551", "동탄": "0552", "평택지제": "0553", "경주": "0508", "곡성": "0049",
    "공주": "0514", "광주송정": "0036", "구례구": "0050", "김천(구미)": "0507", "나주": "0037",
    "남원": "0048", "대전": "0010", "동대구": "0015", "마산": "0059", "목포": "0041",
    "밀양": "0017", "부산": "0020", "서대구": "0506", "순천": "0051", "여수EXPO": "0053",
    "여천": "0139", "오송": "0297", "울산(통도사)": "0509", "익산": "0030", "전주": "0045",
    "정읍": "0033", "진영": "0056", "진주": "0063", "창원": "0057", "창원중앙": "0512",
    "천안아산": "0502", "포항": "0515",
    "서울": "0001", "용산": "0002", "영등포": "0003", "광명": "0007", "수원": "0008" 
  };

  static String getSrtStationCode(String name) => srtStationCodes[name] ?? "0000";

  static String getSrtStationName(String code) {
    // Reverse lookup
    for (var entry in srtStationCodes.entries) {
      if (entry.value == code) return entry.key;
    }
    return code; // Fallback
  }
}
